; Disassembly of "Nectaris GB (Japan) (SGB Enhanced).gb"
; This file was created with:
; mgbdis v2.0 - Game Boy ROM disassembler by Matt Currie and contributors.
; https://github.com/mattcurrie/mgbdis

INCLUDE "charmap.inc"
INCLUDE "common.inc"
INCLUDE "consts.inc"
INCLUDE "hardware.inc"
INCLUDE "macro.inc"
INCLUDE "trap.inc"

CHARMAP "｡", $a1
CHARMAP "､", $a4
CHARMAP "･", $a5
CHARMAP "ｦ", $a6
CHARMAP "ｧ", $a7
CHARMAP "ｨ", $a8
CHARMAP "ｩ", $a9
CHARMAP "ｪ", $aa
CHARMAP "ｫ", $ab
CHARMAP "ｬ", $ac
CHARMAP "ｭ", $ad
CHARMAP "ｮ", $ae
CHARMAP "ｯ", $af
CHARMAP "ｰ", $b0
CHARMAP "ｱ", $b1
CHARMAP "ｲ", $b2
CHARMAP "ｳ", $b3
CHARMAP "ｴ", $b4
CHARMAP "ｵ", $b5
CHARMAP "ｶ", $b6
CHARMAP "ｷ", $b7
CHARMAP "ｸ", $b8
CHARMAP "ｹ", $b9
CHARMAP "ｺ", $ba
CHARMAP "ｻ", $bb
CHARMAP "ｼ", $bc
CHARMAP "ｽ", $bd
CHARMAP "ｾ", $be
CHARMAP "ｿ", $bf
CHARMAP "ﾀ", $c0
CHARMAP "ﾁ", $c1
CHARMAP "ﾂ", $c2
CHARMAP "ﾃ", $c3
CHARMAP "ﾄ", $c4
CHARMAP "ﾅ", $c5
CHARMAP "ﾆ", $c6
CHARMAP "ﾇ", $c7
CHARMAP "ﾈ", $c8
CHARMAP "ﾉ", $c9
CHARMAP "ﾊ", $ca
CHARMAP "ﾋ", $cb
CHARMAP "ﾌ", $cc
CHARMAP "ﾍ", $cd
CHARMAP "ﾎ", $ce
CHARMAP "ﾏ", $cf
CHARMAP "ﾐ", $d0
CHARMAP "ﾑ", $d1
CHARMAP "ﾒ", $d2
CHARMAP "ﾓ", $d3
CHARMAP "ﾔ", $d4
CHARMAP "ﾕ", $d5
CHARMAP "ﾖ", $d6
CHARMAP "ﾗ", $d7
CHARMAP "ﾘ", $d8
CHARMAP "ﾙ", $d9
CHARMAP "ﾚ", $da
CHARMAP "ﾛ", $db
CHARMAP "ﾜ", $dc
CHARMAP "ﾝ", $dd
CHARMAP "ﾞ", $de
CHARMAP "ﾟ", $df

SECTION "ROM Bank $007", ROMX[$4000], BANK[$7]

    db " 0123456789=####################ABCDEFGHIJKLMNOPQRSTUVWXYZ[]    "
    db " ｧｨｩｪｫｬｭｮｯｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｰﾟﾞ_    "

    db $01, $04, $12, $09
    db $05, $04, "MAIN MENU", $ff
    db $04, $06, " CONTINUE", $ff
    db $04, $08, " PLAY NEWGAME", $ff
    db $04, $0a, " CONSTRUCTION", $ff
    db $04, $0c, " GB KISS", $ff
    db $ff

    db $01, $05, $12, $07
    db $05, $05, "MAIN MENU", $ff
    db $04, $07, " CONTINUE", $ff
    db $04, $09, " PLAY NEWGAME", $ff
    db $04, $0b, " CONSTRUCTION", $ff
    db $ff

    db $01, $03, $12, $0b
    db $05, $03, "MAIN MENU", $ff
    db $04, $05, " CONTINUE", $ff
    db $04, $07, " PLAY NEWGAME", $ff
    db $04, $09, " CONSTRUCTION", $ff
    db $04, $0b, " GB KISS", $ff
    db $04, $0d, " QUICK START", $ff
    db $ff

    db $01, $04, $12, $09
    db $05, $04, "MAIN MENU", $ff
    db $04, $06, " CONTINUE", $ff
    db $04, $08, " PLAY NEWGAME", $ff
    db $04, $0a, " CONSTRUCTION", $ff
    db $04, $0c, " QUICK START", $ff
    db $ff

    db $01, $05, $12, $05
    db $06, $05, "CONTINUE", $ff
    db $04, $07, " LOAD DATA", $ff
    db $04, $09, " PASSWORD", $ff
    db $ff

    db $01, $05, $12, $07
    db $04, $05, "PLAY NEWGAME", $ff
    db $04, $07, " STORY MAP", $ff
    db $04, $09, " LEGEND MAP", $ff
    db $04, $0b, " CAMPAIGN MAP", $ff
    db $ff

    db $01, $02, $12, $0b
    db $05, $02, " GB KISS ", $ff
    db $04, $04, " ﾃﾞｰﾀｦｵｸﾙ", $ff
    db $04, $06, " ﾃﾞｰﾀｦﾓﾗｳ", $ff
    db $04, $08, " ﾊﾟｿｺﾝﾆｵｸﾙ", $ff
    db $04, $0a, " ﾊﾟｿｺﾝｶﾗﾓﾗｳ", $ff
    db $04, $0c, " KISS MENU", $ff
    db $ff

    db $01, $04, $12, $07
    db $04, $04, "CONSTRUCTION", $ff
    db $04, $06, " NEW EDIT MAP", $ff
    db $04, $08, " LOAD EDIT MAP", $ff
    db $04, $0a, " PLAY EDIT MAP", $ff
    db $ff

    db $01, $05, $12, $07
    db $04, $05, "QUICK START", $ff
    db $04, $07, " 1PLAY MODE", $ff
    db $04, $09, " 2PLAY MODE", $ff
    db $04, $0b, " GUICY MODE", $ff
    db $ff

    db $01, $05, $12, $05
    db $06, $05, "CAMPAIGN", $ff
    db $04, $07, " WINNERS", $ff
    db $04, $09, " SPWINNERS", $ff
    db $ff

    db $01, $03, $12, $07
    db $04, $03, $ff
    db $04, $05, " DATA SAVE", $ff
    db $04, $07, " GIVE UP", $ff
    db $04, $09, " RETURN GAME", $ff
    db $ff

    db $01, $05, $12, $05
    db $04, $03, $ff
    db $04, $07, " GIVE UP", $ff
    db $04, $09, " RETURN GAME", $ff
    db $ff

    db $01, $05, $12, $07
    db $02, $03, " ﾂｳｼﾝｼﾞｭﾝﾋﾞﾁｭｳ ", $ff
    db $02, $07, " ｹﾞｰﾑﾎﾞｰｲﾄﾞｳｼｦ", $ff
    db $02, $09, " ｸｯﾂｹﾃ Aﾎﾞﾀﾝｦ ", $ff
    db $02, $0b, " ｵｼﾃｸﾀﾞｻｲ", $ff
    db $ff

    db $01, $05, $12, $07
    db $02, $03, " ﾂｳｼﾝｼﾞｭﾝﾋﾞﾁｭｳ ", $ff
    db $02, $07, " GB KISS LINKﾆ", $ff
    db $02, $09, " ｹﾞｰﾑﾎﾞｰｲｦｸｯﾂｹﾃ", $ff
    db $02, $0b, " Aﾎﾞﾀﾝｦｵｼﾃｸﾀﾞｻｲ", $ff
    db $ff

    db $01, $06, $12, $05
    db $02, $04, " ﾃﾞｰﾀｦ ｵｸｯﾃｲﾏｽ ", $ff
    db $02, $08, "ﾁｭｳｼｽﾙﾊﾞｱｲﾊ", $ff
    db $02, $0a, "Bﾎﾞﾀﾝｦ ｵｼﾃｸﾀﾞｻｲ", $ff
    db $ff

    db $01, $06, $12, $05
    db $02, $04, " ﾃﾞｰﾀｦ ｳｹﾄｯﾃｲﾏｽ ", $ff
    db $02, $08, "ﾁｭｳｼｽﾙﾊﾞｱｲﾊ", $ff
    db $02, $0a, "Bﾎﾞﾀﾝｦ ｵｼﾃｸﾀﾞｻｲ", $ff
    db $ff

    db $01, $06, $12, $03
    db $02, $06, $ff
    db $03, $08, "ﾂｳｼﾝｶﾞ ｵﾜﾘﾏｼﾀ", $ff
    db $ff

    db $00, $05, $14, $05
    db $02, $05, $ff
    db $01, $07, "ﾂｳｼﾝｦ ｼｯﾊﾟｲ ｼﾏｼﾀ", $ff
    db $01, $09, "ﾓｳｲﾁﾄﾞ ﾔﾘﾅｵｼﾃｸﾀﾞｻｲ", $ff
    db $ff

    db $3e, $00, $ea, $78, $d8, $ea, $79, $d8, $7d, $ea, $e0
    db $d8, $7c, $ea, $e1, $d8, $cd, $66, $0e, $cd, $98, $45, $cd, $98, $45, $cd, $5d
    db $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $df, $44, $cb, $4f, $c2, $f4, $44
    db $cb, $77, $c2, $09, $45, $cb, $7f, $c2, $28, $45, $cd, $5d, $08, $18, $dc, $3e
    db $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $e4
    db $44, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0
    db $8c, $cb, $4f, $c2, $f9, $44, $3e, $ff, $c9, $fa, $df, $d8, $fe, $00, $28, $ab
    db $3d, $ea, $df, $d8, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0
    db $8c, $cb, $77, $20, $f4, $c3, $bb, $44, $fa, $be, $d8, $3d, $47, $fa, $df, $d8
    db $b8, $28, $88, $3c, $ea, $df, $d8, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd
    db $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $bb, $44, $cd, $33, $09, $fa, $e0
    db $d8, $6f, $fa, $e1, $d8, $67, $2a, $47, $2a, $4f, $2a, $57, $2a, $5f, $78, $fe
    db $ff, $28, $03, $cd, $3a, $60, $2a, $47, $2a, $4f, $cd, $09, $61, $3e, $00, $ea
    db $be, $d8, $11, $bf, $d8, $2a, $fe, $ff, $28, $1a, $47, $3d, $12, $13, $2a, $4f
    db $12, $13, $f5, $c5, $d5, $cd, $09, $61, $d1, $c1, $f1, $fa, $be, $d8, $3c, $ea
    db $be, $d8, $18, $e1, $cd, $bb, $0a, $c9, $fa, $df, $d8, $cb, $27, $21, $bf, $d8
    db $cd, $8f, $08, $2a, $cb, $27, $cb, $27, $cb, $27, $c6, $08, $57, $7e, $cb, $27
    db $cb, $27, $cb, $27, $c6, $10, $5f, $3e, $00, $0e, $7f, $cd, $ff, $08, $c9, $3e
    db $00, $ea, $e9, $d8, $ea, $ea, $d8, $cd, $ee, $0e, $cd, $09, $49, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $f3, $45, $cb, $4f, $c2, $43, $46, $cb
    db $57, $c2, $58, $46, $cb, $77, $c2, $db, $46, $cb, $7f, $c2, $16, $47, $cd, $5d
    db $08, $18, $d7, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $f3, $45
    db $fa, $e8, $d8, $fe, $00, $28, $23, $3e, $0a, $cd, $07, $0d, $fa, $e9, $d8, $47
    db $fa, $ea, $d8, $80, $3c, $cd, $c0, $6a, $fe, $00, $c2, $40, $46, $cd, $52, $49
    db $fe, $00, $28, $1c, $cd, $ee, $0e, $c3, $ca, $45, $fa, $e9, $d8, $47, $fa, $ea
    db $d8, $80, $3c, $cd, $c0, $6a, $fe, $00, $c2, $ca, $45, $3e, $0a, $cd, $07, $0d
    db $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $4f, $c2, $48, $46, $3e, $ff, $c9, $fa, $e8, $d8, $fe, $01, $ca, $ca, $45
    db $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $cd, $c0, $6a, $fe, $00, $c2, $d3
    db $46, $fa, $a8, $d7, $f5, $3e, $0a, $cd, $07, $0d, $fa, $e9, $d8, $47, $fa, $ea
    db $d8, $80, $3c, $cd, $12, $6a, $cd, $44, $12, $fa, $a8, $d7, $fe, $04, $30, $0c
    db $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $cd, $12, $6a, $f1, $ea, $a8, $d7
    db $3e, $00, $ea, $9d, $d7, $ea, $9e, $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7
    db $cd, $24, $12, $3e, $00, $ea, $a1, $d7, $cd, $10, $16, $fe, $00, $ca, $f3, $45
    db $fe, $01, $c2, $b3, $46, $3e, $0d, $cd, $07, $0d, $cd, $e7, $0d, $cd, $ee, $0e
    db $c3, $ca, $45, $3e, $0e, $cd, $07, $0d, $c3, $ca, $45, $fa, $e9, $d8, $fe, $00
    db $20, $1c, $fa, $ea, $d8, $fe, $00, $ca, $ca, $45, $d6, $03, $ea, $ea, $d8, $cd
    db $ee, $0e, $3e, $02, $ea, $e9, $d8, $3e, $03, $cd, $07, $0d, $18, $09, $3d, $ea
    db $e9, $d8, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb
    db $77, $20, $f4, $c3, $ca, $45, $fa, $e9, $d8, $fe, $02, $20, $1c, $fa, $ea, $d8
    db $fe, $03, $ca, $ca, $45, $c6, $03, $ea, $ea, $d8, $cd, $ee, $0e, $3e, $00, $ea
    db $e9, $d8, $3e, $03, $cd, $07, $0d, $18, $09, $3c, $ea, $e9, $d8, $3e, $03, $cd
    db $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $ca
    db $45

    db "NO DATA", $ff
    db "STORY MODE", $ff
    db "LEGEND MODE", $ff
    db "CAMPAIGN MODE", $ff
    db "CONSTRUCTION MODE", $ff
    db "CONSTRUCTION DATA", $ff
    db "FUMEI", $ff
    db "[      ]", $ff
    db "MAP[55] TURN[55]", $ff

    db $cd, $33, $09, $fa, $ea, $d8, $4f, $06, $00, $c5, $79, $3c, $cd, $c0
    db $6a, $fe, $00, $28, $19, $c1, $c5, $cd, $b5, $48, $78, $cb, $27, $47, $cb, $27
    db $80, $3c, $4f, $06, $02, $21, $51, $47, $cd, $09, $61, $c3, $a8, $48, $c1, $c5
    db $c1, $c5, $cd, $b5, $48, $78, $cb, $27, $47, $cb, $27, $80, $3c, $4f, $06, $02
    db $fa, $f2, $d8, $21, $59, $47, $fe, $00, $28, $1f, $21, $64, $47, $fe, $01, $28
    db $18, $21, $70, $47, $fe, $02, $28, $11, $21, $7e, $47, $fe, $03, $28, $0a, $21
    db $90, $47, $fe, $04, $28, $03, $21, $a2, $47, $c5, $cd, $09, $61, $c1, $0c, $21
    db $a8, $47, $c5, $cd, $09, $61, $c1, $21, $f3, $d8, $3e, $ff, $ea, $f9, $d8, $c5
    db $04, $cd, $09, $61, $c1, $fa, $f2, $d8, $fe, $04, $ca, $a8, $48, $0c, $21, $b1
    db $47, $c5, $cd, $09, $61, $c1, $78, $c6, $04, $47, $fa, $f1, $d8, $5f, $fa, $f2
    db $d8, $fe, $00, $28, $18, $f5, $7b, $d6, $10, $5f, $f1, $fe, $01, $28, $0e, $f5
    db $7b, $d6, $10, $5f, $f1, $fe, $02, $28, $19, $fe, $03, $28, $15, $fa, $f2, $d8
    db $fe, $00, $28, $06, $fe, $01, $28, $02, $28, $08, $7b, $fe, $10, $38, $03, $d6
    db $4c, $5f, $1c, $16, $02, $c5, $cd, $4d, $61, $c1, $78, $c6, $09, $47, $fa, $fc
    db $d8, $3c, $5f, $16, $02, $cd, $4d, $61, $c1, $0c, $04, $78, $fe, $03, $c2, $cb
    db $47, $cd, $bb, $0a, $c9, $c5, $78, $cb, $27, $47, $cb, $27, $80, $4f, $06, $01
    db $16, $13, $1e, $04, $cd, $3a, $60, $c1, $c5, $16, $02, $59, $78, $cb, $27, $47
    db $cb, $27, $80, $3c, $3c, $3c, $3c, $4f, $06, $11, $cd, $4d, $61, $c1, $c9, $c5
    db $78, $cb, $27, $47, $cb, $27, $80, $4f, $06, $01, $16, $13, $1e, $04, $cd, $7f
    db $60, $c1, $c5, $16, $02, $59, $78, $cb, $27, $47, $cb, $27, $80, $3c, $3c, $3c
    db $3c, $4f, $06, $11, $cd, $4d, $61, $c1, $c9, $fa, $e9, $d8, $cb, $27, $5f, $cb
    db $27, $83, $cb, $27, $cb, $27, $cb, $27, $c6, $20, $5f, $16, $0b, $3e, $01, $0e
    db $1e, $d5, $cd, $ff, $08, $d1, $7b, $c6, $08, $5f, $3e, $02, $0e, $1f, $cd, $ff
    db $08, $c9, $b5, $b0, $ca, $de, $b0, $d7, $b2, $c4, $bc, $c3, $b2, $b2, $c3, $de
    db $bd, $b6, $ff, $20, $20, $ca, $b2, $20, $41, $20, $20, $20, $b2, $b2, $b4, $20
    db $42, $ff, $3e, $00, $ea, $ff, $d8, $06, $01, $0e, $05, $16, $12, $1e, $05, $cd
    db $3a, $60, $06, $02, $0e, $07, $21, $32, $49, $cd, $09, $61, $06, $02, $0e, $09
    db $21, $43, $49, $cd, $09, $61, $cd, $bb, $0a, $cd, $bd, $49, $cd, $5d, $08, $cd
    db $9c, $07, $f0, $8c, $cb, $47, $c2, $93, $49, $cb, $4f, $c2, $a8, $49, $cd, $5d
    db $08, $18, $e6, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $47, $c2, $98, $49, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $4f, $c2, $ad, $49, $3e, $ff, $c9, $16, $00, $1e
    db $00, $3e, $00, $0e, $7f, $cd, $ff, $08, $c9, $3e, $00, $ea, $e9, $d8, $ea, $ea
    db $d8, $cd, $36, $0f, $cd, $17, $4d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb
    db $47, $c2, $fd, $49, $cb, $4f, $c2, $79, $4a, $cb, $57, $c2, $8e, $4a, $cb, $77
    db $c2, $42, $4b, $cb, $7f, $c2, $7d, $4b, $cd, $5d, $08, $18, $d7, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $fd, $49, $fa, $e8, $d8, $fe, $00, $28
    db $25, $3e, $0a, $cd, $07, $0d, $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $c6
    db $06, $cd, $c0, $6a, $fe, $00, $c2, $76, $4a, $cd, $52, $49, $fe, $00, $28, $46
    db $cd, $36, $0f, $c3, $d4, $49, $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $c6
    db $06, $cd, $c0, $6a, $fe, $00, $c2, $d4, $49, $fa, $a8, $d7, $fe, $02, $30, $0f
    db $fa, $f2, $d8, $fe, $02, $38, $1a, $3e, $0e, $cd, $07, $0d, $c3, $d4, $49, $fa
    db $a8, $d7, $47, $fa, $f2, $d8, $b8, $28, $08, $3e, $0e, $cd, $07, $0d, $c3, $d4
    db $49, $3e, $0a, $cd, $07, $0d, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d
    db $08, $cd, $9c, $07, $f0, $8c, $cb, $4f, $c2, $7e, $4a, $3e, $ff, $c9, $fa, $e8
    db $d8, $fe, $01, $ca, $d4, $49, $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $c6
    db $06, $cd, $c0, $6a, $fe, $00, $c2, $2d, $4b, $fa, $a8, $d7, $fe, $02, $30, $0a
    db $fa, $f2, $d8, $fe, $02, $38, $10, $c3, $2d, $4b, $fa, $a8, $d7, $47, $fa, $f2
    db $d8, $b8, $28, $03, $c3, $2d, $4b, $fa, $a8, $d7, $f5, $3e, $0a, $cd, $07, $0d
    db $fa, $e9, $d8, $47, $fa, $ea, $d8, $80, $3c, $c6, $06, $cd, $12, $6a, $cd, $44
    db $12, $fa, $a8, $d7, $fe, $03, $38, $0e, $fa, $e9, $d8, $47, $fa, $ea, $d8, $80
    db $3c, $c6, $06, $cd, $12, $6a, $f1, $ea, $a8, $d7, $3e, $00, $ea, $9d, $d7, $ea
    db $9e, $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7, $cd, $24, $12, $3e, $00, $ea
    db $a1, $d7, $cd, $10, $16, $fe, $00, $ca, $fd, $49, $fe, $01, $c2, $0d, $4b, $3e
    db $0d, $cd, $07, $0d, $cd, $e7, $0d, $cd, $36, $0f, $c3, $d4, $49, $3e, $0e, $cd
    db $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $57, $c2, $32, $4b, $c3
    db $d4, $49, $fa, $e9, $d8, $fe, $00, $20, $1c, $fa, $ea, $d8, $fe, $00, $ca, $d4
    db $49, $d6, $03, $ea, $ea, $d8, $cd, $36, $0f, $3e, $02, $ea, $e9, $d8, $3e, $03
    db $cd, $07, $0d, $18, $09, $3d, $ea, $e9, $d8, $3e, $03, $cd, $07, $0d, $cd, $5d
    db $08, $cd, $9c, $07, $f0, $8c, $cb, $77, $20, $f4, $c3, $d4, $49, $fa, $e9, $d8
    db $fe, $02, $20, $1c, $fa, $ea, $d8, $fe, $03, $ca, $d4, $49, $c6, $03, $ea, $ea
    db $d8, $cd, $36, $0f, $3e, $00, $ea, $e9, $d8, $3e, $03, $cd, $07, $0d, $18, $09
    db $3c, $ea, $e9, $d8, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0
    db $8c, $cb, $7f, $20, $f4, $c3, $d4, $49, $cd, $33, $09, $fa, $ea, $d8, $c6, $06
    db $4f, $06, $00, $c5, $79, $3c, $cd, $c0, $6a, $fe, $00, $28, $25, $c1, $c5, $fa
    db $e8, $d8, $fe, $00, $20, $05, $cd, $bb, $4c, $18, $03, $cd, $e9, $4c, $78, $cb
    db $27, $47, $cb, $27, $80, $3c, $4f, $06, $02, $21, $51, $47, $cd, $09, $61, $c3
    db $ae, $4c, $c1, $c5, $fa, $f2, $d8, $4f, $fa, $a8, $d7, $fe, $01, $20, $02, $3e
    db $00, $b9, $20, $07, $c1, $c5, $cd, $bb, $4c, $18, $05, $c1, $c5, $cd, $e9, $4c
    db $78, $cb, $27, $47, $cb, $27, $80, $3c, $4f, $06, $02, $fa, $f2, $d8, $21, $59
    db $47, $fe, $00, $28, $1f, $21, $64, $47, $fe, $01, $28, $18, $21, $70, $47, $fe
    db $02, $28, $11, $21, $7e, $47, $fe, $03, $28, $0a, $21, $90, $47, $fe, $04, $28
    db $03, $21, $a2, $47, $c5, $cd, $09, $61, $c1, $0c, $21, $a8, $47, $c5, $cd, $09
    db $61, $c1, $21, $f3, $d8, $3e, $ff, $ea, $f9, $d8, $c5, $04, $cd, $09, $61, $c1
    db $fa, $f2, $d8, $fe, $04, $ca, $ae, $4c, $0c, $21, $b1, $47, $c5, $cd, $09, $61
    db $c1, $78, $c6, $04, $47, $fa, $f1, $d8, $5f, $fa, $f2, $d8, $fe, $00, $28, $14
    db $f5, $7b, $d6, $10, $5f, $f1, $fe, $01, $28, $0a, $f5, $7b, $d6, $10, $5f, $f1
    db $fe, $02, $28, $00, $1c, $7b, $5f, $16, $02, $c5, $cd, $4d, $61, $c1, $78, $c6
    db $09, $47, $fa, $fc, $d8, $cb, $3f, $3c, $5f, $16, $02, $cd, $4d, $61, $c1, $0c
    db $04, $78, $fe, $03, $c2, $c3, $4b, $cd, $bb, $0a, $c9, $c5, $78, $cb, $27, $47
    db $cb, $27, $80, $4f, $06, $01, $16, $13, $1e, $04, $cd, $3a, $60, $c1, $c5, $16
    db $02, $79, $d6, $05, $3d, $5f, $78, $cb, $27, $47, $cb, $27, $80, $3c, $3c, $3c
    db $3c, $4f, $06, $11, $cd, $4d, $61, $c1, $c9, $c5, $78, $cb, $27, $47, $cb, $27
    db $80, $4f, $06, $01, $16, $13, $1e, $04, $cd, $7f, $60, $c1, $c5, $16, $02, $79
    db $d6, $05, $3d, $5f, $78, $cb, $27, $47, $cb, $27, $80, $3c, $3c, $3c, $3c, $4f
    db $06, $11, $cd, $4d, $61, $c1, $c9, $fa, $e9, $d8, $cb, $27, $5f, $cb, $27, $83
    db $cb, $27, $cb, $27, $cb, $27, $c6, $20, $5f, $16, $0b, $3e, $01, $0e, $1e, $d5
    db $cd, $ff, $08, $d1, $7b, $c6, $08, $5f, $3e, $02, $0e, $1f, $cd, $ff, $08, $c9

    db $01, $05, $12, $05
    db $03, $05, "INPUT PASSWORD", $ff
    db $02, $08, "PASS_WORD ______", $ff
    db $ff

    db "INPUT ERROR", $ff
    db "           ", $ff

    db $cd, $4b, $0d, $3e, $04, $cd, $bf, $0c, $21, $40, $4d, $7d, $ea, $e0, $d8
    db $7c, $ea, $e1, $d8, $cd, $66, $0e, $cd, $bb, $0a, $21, $01, $d9, $06, $06, $3e
    db $20, $22, $05, $20, $fc, $3e, $00, $77, $3e, $00, $ea, $00, $d9, $cd, $0e, $4f
    db $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $db, $4d, $cb, $4f, $c2
    db $2f, $4e, $cb, $67, $c2, $44, $4e, $cb, $6f, $c2, $77, $4e, $cb, $77, $c2, $98
    db $4e, $cb, $7f, $c2, $d3, $4e, $cd, $5d, $08, $18, $d2, $cd, $7e, $0f, $fe, $00
    db $28, $34, $3e, $0e, $cd, $07, $0d, $06, $05, $0e, $0d, $c5, $21, $69, $4d, $cd
    db $09, $61, $cd, $bb, $0a, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2
    db $f5, $4d, $cd, $3c, $0c, $3e, $05, $cd, $07, $0d, $c1, $21, $75, $4d, $cd, $09
    db $61, $cd, $bb, $0a, $18, $97, $78, $ea, $9a, $d7, $3e, $06, $cd, $07, $0d, $cd
    db $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $1f, $4e, $3e, $00, $c9, $3e
    db $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $4f, $c2, $34
    db $4e, $3e, $ff, $c9, $fa, $00, $d9, $fe, $05, $ca, $ad, $4d, $21, $01, $d9, $fa
    db $00, $d9, $cd, $8f, $08, $7e, $fe, $20, $ca, $ad, $4d, $fa, $00, $d9, $3c, $ea
    db $00, $d9, $3e, $05, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb
    db $67, $c2, $67, $4e, $c3, $ad, $4d, $fa, $00, $d9, $fe, $00, $ca, $ad, $4d, $3d
    db $ea, $00, $d9, $3e, $05, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $6f, $c2, $88, $4e, $c3, $ad, $4d, $3e, $05, $cd, $07, $0d, $fa, $00, $d9
    db $21, $01, $d9, $cd, $8f, $08, $7e, $fe, $20, $20, $05, $3e, $41, $77, $18, $14
    db $fe, $5a, $20, $05, $3e, $30, $77, $18, $0b, $fe, $39, $20, $05, $3e, $41, $77
    db $18, $02, $3c, $77, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $77, $20, $f4
    db $c3, $ad, $4d, $3e, $05, $cd, $07, $0d, $fa, $00, $d9, $21, $01, $d9, $cd, $8f
    db $08, $7e, $fe, $20, $20, $05, $3e, $39, $77, $18, $14, $fe, $30, $20, $05, $3e
    db $5a, $77, $18, $0b, $fe, $41, $20, $05, $3e, $39, $77, $18, $02, $3d, $77, $cd
    db $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $ad, $4d, $21, $01
    db $d9, $7d, $ea, $c1, $d7, $7c, $ea, $c2, $d7, $3e, $01, $16, $68, $1e, $4f, $06
    db $06, $cd, $f0, $14, $fa, $00, $d9, $cb, $27, $cb, $27, $cb, $27, $c6, $68, $57
    db $1e, $47, $3e, $00, $0e, $1f, $cd, $ff, $08, $c9, $3e, $00, $ea, $09, $d9, $ea
    db $0a, $d9, $cd, $c3, $50, $cd, $0f, $51, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $47, $c2, $78, $4f, $cb, $4f, $c2, $9a, $4f, $cb, $57, $c2, $af, $4f, $cb
    db $67, $c2, $03, $50, $cb, $6f, $c2, $28, $50, $cb, $77, $c2, $4d, $50, $cb, $7f
    db $c2, $88, $50, $cd, $5d, $08, $18, $cd, $fa, $09, $d9, $47, $fa, $0a, $d9, $80
    db $c6, $20, $ea, $9a, $d7, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07
    db $f0, $8c, $cb, $47, $c2, $8a, $4f, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd
    db $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $4f, $c2, $9f, $4f, $3e, $ff, $c9, $3e
    db $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $57, $20, $f4
    db $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $c6, $20, $ea, $9a, $d7, $cd, $44, $12
    db $3e, $00, $ea, $9d, $d7, $ea, $9e, $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7
    db $cd, $24, $12, $3e, $00, $ea, $a1, $d7, $cd, $10, $16, $fe, $00, $ca, $78, $4f
    db $fe, $01, $c2, $e3, $4f, $3e, $0d, $cd, $07, $0d, $cd, $e7, $0d, $cd, $c3, $50
    db $c3, $45, $4f, $fa, $0a, $d9, $fe, $21, $d2, $45, $4f, $c6, $0b, $ea, $0a, $d9
    db $cd, $c3, $50, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $67, $c2, $18, $50, $c3, $45, $4f, $fa, $0a, $d9, $fe, $00, $ca, $45, $4f
    db $d6, $0b, $ea, $0a, $d9, $cd, $c3, $50, $3e, $03, $cd, $07, $0d, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $6f, $c2, $3d, $50, $c3, $45, $4f, $fa, $09, $d9
    db $fe, $00, $28, $0b, $3d, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa
    db $0a, $d9, $fe, $00, $ca, $45, $4f, $d6, $0b, $ea, $0a, $d9, $cd, $c3, $50, $3e
    db $0a, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0
    db $8c, $cb, $77, $20, $f4, $c3, $45, $4f, $fa, $09, $d9, $fe, $0a, $28, $0b, $3c
    db $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe, $21, $ca
    db $45, $4f, $c6, $0b, $ea, $0a, $d9, $cd, $c3, $50, $3e, $00, $ea, $09, $d9, $3e
    db $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $7f, $20, $f4
    db $c3, $45, $4f, $cd, $33, $09, $06, $01, $0e, $01, $16, $12, $1e, $0e, $cd, $3a
    db $60, $21, $2f, $53, $06, $04, $0e, $03, $cd, $09, $61, $06, $00, $c5, $fa, $0a
    db $d9, $80, $16, $00, $5f, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb
    db $12, $cb, $23, $cb, $12, $21, $49, $55, $cd, $ba, $08, $78, $c6, $05, $4f, $06
    db $05, $cd, $09, $61, $c1, $04, $78, $fe, $0b, $20, $d2, $cd, $bb, $0a, $c9, $fa
    db $09, $d9, $cb, $27, $cb, $27, $cb, $27, $c6, $38, $5f, $16, $20, $3e, $00, $0e
    db $7f, $cd, $ff, $08, $c9, $3e, $00, $ea, $09, $d9, $ea, $0a, $d9, $cd, $c9, $52
    db $cd, $19, $53, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $63, $51
    db $cb, $4f, $c2, $83, $51, $cb, $57, $c2, $98, $51, $cb, $67, $c2, $ea, $51, $cb
    db $6f, $c2, $22, $52, $cb, $77, $c2, $47, $52, $cb, $7f, $c2, $82, $52, $cd, $5d
    db $08, $18, $cd, $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $ea, $9a, $d7, $3e, $0a
    db $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $73, $51
    db $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $4f, $c2, $88, $51, $3e, $ff, $c9, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $57, $20, $f4, $fa, $09, $d9, $47, $fa, $0a, $d9
    db $80, $ea, $9a, $d7, $cd, $44, $12, $3e, $00, $ea, $9d, $d7, $ea, $9e, $d7, $3e
    db $05, $ea, $9f, $d7, $ea, $a0, $d7, $cd, $24, $12, $3e, $00, $ea, $a1, $d7, $cd
    db $10, $16, $fe, $00, $ca, $63, $51, $fe, $01, $c2, $ca, $51, $3e, $0d, $cd, $07
    db $0d, $cd, $e7, $0d, $cd, $c9, $52, $c3, $30, $51, $fa, $0a, $d9, $fe, $41, $d2
    db $30, $51, $c6, $0b, $ea, $0a, $d9, $cd, $c9, $52, $fa, $0a, $d9, $fe, $41, $da
    db $0d, $52, $fa, $09, $d9, $fe, $0a, $20, $04, $3d, $ea, $09, $d9, $3e, $03, $cd
    db $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $67, $c2, $12, $52, $c3
    db $30, $51, $fa, $0a, $d9, $fe, $00, $ca, $30, $51, $d6, $0b, $ea, $0a, $d9, $cd
    db $c9, $52, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb
    db $6f, $c2, $37, $52, $c3, $30, $51, $fa, $09, $d9, $fe, $00, $28, $0b, $3d, $ea
    db $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe, $00, $ca, $30
    db $51, $d6, $0b, $ea, $0a, $d9, $cd, $c9, $52, $3e, $0a, $ea, $09, $d9, $3e, $03
    db $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $77, $20, $f4, $c3
    db $30, $51, $fa, $09, $d9, $fe, $0a, $28, $17, $47, $fa, $0a, $d9, $80, $fe, $4b
    db $30, $28, $fa, $09, $d9, $3c, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a
    db $fa, $0a, $d9, $fe, $41, $ca, $30, $51, $c6, $0b, $ea, $0a, $d9, $cd, $c9, $52
    db $3e, $00, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07
    db $f0, $8c, $cb, $7f, $20, $f4, $c3, $30, $51, $cd, $33, $09, $06, $01, $0e, $01
    db $16, $12, $1e, $0e, $cd, $3a, $60, $21, $3c, $53, $06, $04, $0e, $03, $cd, $09
    db $61, $06, $00, $fa, $0a, $d9, $80, $fe, $4c, $30, $2a, $c5, $16, $00, $5f, $cb
    db $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $21
    db $49, $53, $cd, $ba, $08, $78, $c6, $05, $4f, $06, $05, $cd, $09, $61, $c1, $04
    db $78, $fe, $0b, $20, $ce, $cd, $bb, $0a, $c9, $fa, $09, $d9, $cb, $27, $cb, $27
    db $cb, $27, $c6, $38, $5f, $16, $20, $3e, $00, $0e, $7f, $cd, $ff, $08, $c9

    db "CAMPAIGN MAP", $ff
    db "   ALL MAP  ", $ff
    db "STORY    01", $ff, $00, $00, $00, $00
    db "STORY    02", $ff, $00, $00, $00, $00
    db "STORY    03", $ff, $00, $00, $00, $00
    db "STORY    04", $ff, $00, $00, $00, $00
    db "STORY    05", $ff, $00, $00, $00, $00
    db "STORY    06", $ff, $00, $00, $00, $00
    db "STORY    07", $ff, $00, $00, $00, $00
    db "STORY    08", $ff, $00, $00, $00, $00
    db "STORY    09", $ff, $00, $00, $00, $00
    db "STORY    10", $ff, $00, $00, $00, $00
    db "STORY    11", $ff, $00, $00, $00, $00
    db "STORY    12", $ff, $00, $00, $00, $00
    db "STORY    13", $ff, $00, $00, $00, $00
    db "STORY    14", $ff, $00, $00, $00, $00
    db "STORY    15", $ff, $00, $00, $00, $00
    db "STORY    16", $ff, $00, $00, $00, $00
    db "LEGEND   01", $ff, $00, $00, $00, $00
    db "LEGEND   02", $ff, $00, $00, $00, $00
    db "LEGEND   03", $ff, $00, $00, $00, $00
    db "LEGEND   04", $ff, $00, $00, $00, $00
    db "LEGEND   05", $ff, $00, $00, $00, $00
    db "LEGEND   06", $ff, $00, $00, $00, $00
    db "LEGEND   07", $ff, $00, $00, $00, $00
    db "LEGEND   08", $ff, $00, $00, $00, $00
    db "LEGEND   09", $ff, $00, $00, $00, $00
    db "LEGEND   10", $ff, $00, $00, $00, $00
    db "LEGEND   11", $ff, $00, $00, $00, $00
    db "LEGEND   12", $ff, $00, $00, $00, $00
    db "LEGEND   13", $ff, $00, $00, $00, $00
    db "LEGEND   14", $ff, $00, $00, $00, $00
    db "LEGEND   15", $ff, $00, $00, $00, $00
    db "LEGEND   16", $ff, $00, $00, $00, $00
    db "CAMPAIGN 01", $ff, $00, $00, $00, $00
    db "CAMPAIGN 02", $ff, $00, $00, $00, $00
    db "CAMPAIGN 03", $ff, $00, $00, $00, $00
    db "CAMPAIGN 04", $ff, $00, $00, $00, $00
    db "CAMPAIGN 05", $ff, $00, $00, $00, $00
    db "CAMPAIGN 06", $ff, $00, $00, $00, $00
    db "CAMPAIGN 07", $ff, $00, $00, $00, $00
    db "CAMPAIGN 08", $ff, $00, $00, $00, $00
    db "CAMPAIGN 09", $ff, $00, $00, $00, $00
    db "CAMPAIGN 10", $ff, $00, $00, $00, $00
    db "CAMPAIGN 11", $ff, $00, $00, $00, $00
    db "CAMPAIGN 12", $ff, $00, $00, $00, $00
    db "CAMPAIGN 13", $ff, $00, $00, $00, $00
    db "CAMPAIGN 14", $ff, $00, $00, $00, $00
    db "CAMPAIGN 15", $ff, $00, $00, $00, $00
    db "CAMPAIGN 16", $ff, $00, $00, $00, $00
    db "CAMPAIGN 17", $ff, $00, $00, $00, $00
    db "CAMPAIGN 18", $ff, $00, $00, $00, $00
    db "CAMPAIGN 19", $ff, $00, $00, $00, $00
    db "CAMPAIGN 20", $ff, $00, $00, $00, $00
    db "CAMPAIGN 21", $ff, $00, $00, $00, $00
    db "CAMPAIGN 22", $ff, $00, $00, $00, $00
    db "CAMPAIGN 23", $ff, $00, $00, $00, $00
    db "CAMPAIGN 24", $ff, $00, $00, $00, $00
    db "CAMPAIGN 25", $ff, $00, $00, $00, $00
    db "CAMPAIGN 26", $ff, $00, $00, $00, $00
    db "CAMPAIGN 27", $ff, $00, $00, $00, $00
    db "CAMPAIGN 28", $ff, $00, $00, $00, $00
    db "CAMPAIGN 29", $ff, $00, $00, $00, $00
    db "CAMPAIGN 30", $ff, $00, $00, $00, $00
    db "CAMPAIGN 31", $ff, $00, $00, $00, $00
    db "CAMPAIGN 32", $ff, $00, $00, $00, $00
    db "CAMPAIGN 33", $ff, $00, $00, $00, $00
    db "CAMPAIGN 34", $ff, $00, $00, $00, $00
    db "CAMPAIGN 35", $ff, $00, $00, $00, $00
    db "CAMPAIGN 36", $ff, $00, $00, $00, $00
    db "CAMPAIGN 37", $ff, $00, $00, $00, $00
    db "CAMPAIGN 38", $ff, $00, $00, $00, $00
    db "CAMPAIGN 39", $ff, $00, $00, $00, $00
    db "CAMPAIGN 40", $ff, $00, $00, $00, $00
    db "CAMPAIGN 41", $ff, $00, $00, $00, $00
    db "CAMPAIGN 42", $ff, $00, $00, $00, $00
    db "CAMPAIGN 43", $ff, $00, $00, $00, $00
    db "CAMPAIGN 44", $ff, $00, $00, $00, $00

    db "  EDIT MAP  ", $ff
    db "EDITMAP  01", $ff, $00, $00, $00, $00
    db "EDITMAP  02", $ff, $00, $00, $00, $00
    db "EDITMAP  03", $ff, $00, $00, $00, $00
    db "EDITMAP  04", $ff, $00, $00, $00, $00
    db "EDITMAP  05", $ff, $00, $00, $00, $00
    db "EDITMAP  06", $ff, $00, $00, $00, $00
    db "EDITMAP  07", $ff, $00, $00, $00, $00
    db "EDITMAP  08", $ff, $00, $00, $00, $00
    db "EDITMAP  09", $ff, $00, $00, $00, $00
    db "EDITMAP  10", $ff, $00, $00, $00, $00
    db "EDITMAP  11", $ff, $00, $00, $00, $00
    db "EDITMAP  12", $ff, $00, $00, $00, $00
    db "EDITMAP  13", $ff, $00, $00, $00, $00
    db "EDITMAP  14", $ff, $00, $00, $00, $00
    db "EDITMAP  15", $ff, $00, $00, $00, $00
    db "EDITMAP  16", $ff, $00, $00, $00, $00
    db "EDITMAP  17", $ff, $00, $00, $00, $00
    db "EDITMAP  18", $ff, $00, $00, $00, $00
    db "EDITMAP  19", $ff, $00, $00, $00, $00
    db "EDITMAP  20", $ff, $00, $00, $00, $00
    db "EDITMAP  21", $ff, $00, $00, $00, $00
    db "EDITMAP  22", $ff, $00, $00, $00, $00
    db "EDITMAP  23", $ff, $00, $00, $00, $00
    db "EDITMAP  24", $ff, $00, $00, $00, $00
    db "EDITMAP  25", $ff, $00, $00, $00, $00
    db "EDITMAP  26", $ff, $00, $00, $00, $00
    db "EDITMAP  27", $ff, $00, $00, $00, $00
    db "EDITMAP  28", $ff, $00, $00, $00, $00
    db "EDITMAP  29", $ff, $00, $00, $00, $00
    db "EDITMAP  30", $ff, $00, $00, $00, $00
    db "EDITMAP  31", $ff, $00, $00, $00, $00
    db "EDITMAP  32", $ff, $00, $00, $00, $00
    db "EDITMAP  33", $ff, $00, $00, $00, $00
    db "EDITMAP  34", $ff, $00, $00, $00, $00
    db "EDITMAP  35", $ff, $00, $00, $00, $00
    db "EDITMAP  36", $ff, $00, $00, $00, $00
    db "EDITMAP  37", $ff, $00, $00, $00, $00
    db "EDITMAP  38", $ff, $00, $00, $00, $00
    db "EDITMAP  39", $ff, $00, $00, $00, $00
    db "EDITMAP  40", $ff, $00, $00, $00, $00
    db "EDITMAP  41", $ff, $00, $00, $00, $00
    db "EDITMAP  42", $ff, $00, $00, $00, $00
    db "EDITMAP  43", $ff, $00, $00, $00, $00
    db "EDITMAP  44", $ff, $00, $00, $00, $00

    db "WINNERS MAP", $ff
    db "WINNERS  01", $ff, $00, $00, $00, $00
    db "WINNERS  02", $ff, $00, $00, $00, $00
    db "WINNERS  03", $ff, $00, $00, $00, $00
    db "WINNERS  04", $ff, $00, $00, $00, $00
    db "WINNERS  05", $ff, $00, $00, $00, $00
    db "WINNERS  06", $ff, $00, $00, $00, $00
    db "WINNERS  07", $ff, $00, $00, $00, $00
    db "WINNERS  08", $ff, $00, $00, $00, $00
    db "WINNERS  09", $ff, $00, $00, $00, $00
    db "WINNERS  10", $ff, $00, $00, $00, $00
    db "WINNERS  11", $ff, $00, $00, $00, $00
    db "WINNERS  12", $ff, $00, $00, $00, $00
    db "WINNERS  13", $ff, $00, $00, $00, $00
    db "WINNERS  14", $ff, $00, $00, $00, $00
    db "WINNERS  15", $ff, $00, $00, $00, $00
    db "WINNERS  16", $ff, $00, $00, $00, $00
    db "WINNERS  17", $ff, $00, $00, $00, $00
    db "WINNERS  18", $ff, $00, $00, $00, $00
    db "WINNERS  19", $ff, $00, $00, $00, $00
    db "WINNERS  20", $ff, $00, $00, $00, $00
    db "WINNERS  21", $ff, $00, $00, $00, $00
    db "WINNERS  22", $ff, $00, $00, $00, $00
    db "WINNERS  23", $ff, $00, $00, $00, $00
    db "WINNERS  24", $ff, $00, $00, $00, $00
    db "WINNERS  25", $ff, $00, $00, $00, $00
    db "WINNERS  26", $ff, $00, $00, $00, $00
    db "WINNERS  27", $ff, $00, $00, $00, $00
    db "WINNERS  28", $ff, $00, $00, $00, $00
    db "WINNERS  29", $ff, $00, $00, $00, $00
    db "WINNERS  30", $ff, $00, $00, $00, $00
    db "WINNERS  31", $ff, $00, $00, $00, $00
    db "WINNERS  32", $ff, $00, $00, $00, $00
    db "WINNERS  33", $ff, $00, $00, $00, $00
    db "WINNERS  34", $ff, $00, $00, $00, $00
    db "WINNERS  35", $ff, $00, $00, $00, $00
    db "WINNERS  36", $ff, $00, $00, $00, $00
    db "WINNERS  37", $ff, $00, $00, $00, $00
    db "WINNERS  38", $ff, $00, $00, $00, $00
    db "WINNERS  39", $ff, $00, $00, $00, $00
    db "WINNERS  40", $ff, $00, $00, $00, $00

    db "SPWINNERS MAP", $ff
    db "SPWINNERS01", $ff, $00, $00, $00, $00
    db "SPWINNERS02", $ff, $00, $00, $00, $00
    db "SPWINNERS03", $ff, $00, $00, $00, $00
    db "SPWINNERS04", $ff, $00, $00, $00, $00

    db " QUICK START ", $ff
    db "01 STEVEN", $ff, $00, $00, $00, $00, $00, $00
    db "02 ASTRAL", $ff, $00, $00, $00, $00, $00, $00
    db "03 HECKLE", $ff, $00, $00, $00, $00, $00, $00
    db "04 REMING", $ff, $00, $00, $00, $00, $00, $00
    db "05 STEYER", $ff, $00, $00, $00, $00, $00, $00
    db "06 WALTHE", $ff, $00, $00, $00, $00, $00, $00
    db "07 NUMBUT", $ff, $00, $00, $00, $00, $00, $00
    db "08 GUSTAF", $ff, $00, $00, $00, $00, $00, $00
    db "09 DARDIC", $ff, $00, $00, $00, $00, $00, $00
    db "10 KESLLE", $ff, $00, $00, $00, $00, $00, $00
    db "11 BROWNY", $ff, $00, $00, $00, $00, $00, $00
    db "12 BERETO", $ff, $00, $00, $00, $00, $00, $00
    db "13 GRENER", $ff, $00, $00, $00, $00, $00, $00
    db "14 REGERT", $ff, $00, $00, $00, $00, $00, $00
    db "15 SALAMA", $ff, $00, $00, $00, $00, $00, $00
    db "16 ZONECT", $ff, $00, $00, $00, $00, $00, $00
    db "01 REVOLT", $ff, $00, $00, $00, $00, $00, $00
    db "02 ICARUS", $ff, $00, $00, $00, $00, $00, $00
    db "03 CYRANO", $ff, $00, $00, $00, $00, $00, $00
    db "04 RAMSEY", $ff, $00, $00, $00, $00, $00, $00
    db "05 NEWTON", $ff, $00, $00, $00, $00, $00, $00
    db "06 SENECA", $ff, $00, $00, $00, $00, $00, $00
    db "07 SABINE", $ff, $00, $00, $00, $00, $00, $00
    db "08 ARATUS", $ff, $00, $00, $00, $00, $00, $00
    db "09 GALOIS", $ff, $00, $00, $00, $00, $00, $00
    db "10 DARWIN", $ff, $00, $00, $00, $00, $00, $00
    db "11 PASCAL", $ff, $00, $00, $00, $00, $00, $00
    db "12 HALLEY", $ff, $00, $00, $00, $00, $00, $00
    db "13 BORMAN", $ff, $00, $00, $00, $00, $00, $00
    db "14 APPOLO", $ff, $00, $00, $00, $00, $00, $00
    db "15 KAISER", $ff, $00, $00, $00, $00, $00, $00
    db "16 NECTOR", $ff, $00, $00, $00, $00, $00, $00

    db " ｱｲﾃﾆｵｸﾙ ﾃﾞｰﾀｦ", $ff
    db " ｴﾗﾝﾃﾞｸﾀﾞｻｲ", $ff
    db "ﾃﾞｰﾀｦ ｳｹﾙ ﾊﾞｼｮｦ", $ff
    db "ｴﾗﾝﾃﾞｸﾀﾞｻｲ", $ff

    db $06, $01, $0e, $05, $16, $12, $1e, $05, $cd, $3a, $60, $06
    db $02, $0e, $07, $21, $be, $5f, $cd, $09, $61, $06, $02, $0e, $09, $21, $cd, $5f
    db $cd, $09, $61, $cd, $bb, $0a, $c9, $06, $01, $0e, $05, $16, $12, $1e, $05, $cd
    db $3a, $60, $06, $02, $0e, $07, $21, $d9, $5f, $cd, $09, $61, $06, $02, $0e, $09
    db $21, $e9, $5f, $cd, $09, $61, $cd, $bb, $0a, $c9, $e5, $cd, $3f, $09, $e5, $3e
    db $98, $22, $42, $05, $05, $3e, $99, $22, $05, $20, $fc, $3e, $9a, $22, $e1, $3e
    db $40, $cd, $8f, $08, $4b, $e5, $3e, $9b, $22, $42, $05, $05, $3e, $80, $22, $05
    db $20, $fc, $3e, $9c, $22, $e1, $3e, $40, $cd, $8f, $08, $0d, $20, $e7, $3e, $9d
    db $22, $42, $05, $05, $3e, $9e, $22, $05, $20, $fc, $3e, $9f, $22, $e1, $c9, $e5
    db $cd, $3f, $09, $e5, $3e, $18, $22, $42, $05, $05, $3e, $19, $22, $05, $20, $fc
    db $3e, $1a, $22, $e1, $3e, $40, $cd, $8f, $08, $4b, $e5, $3e, $1b, $22, $42, $05
    db $05, $3e, $80, $22, $05, $20, $fc, $3e, $1c, $22, $e1, $3e, $40, $cd, $8f, $08
    db $0d, $20, $e7, $3e, $1d, $22, $42, $05, $05, $3e, $1e, $22, $05, $20, $fc, $3e
    db $1f, $22, $e1, $c9, $e5, $cd, $3f, $09, $e5, $3e, $90, $22, $42, $05, $05, $3e
    db $91, $22, $05, $20, $fc, $3e, $92, $22, $e1, $3e, $40, $cd, $8f, $08, $4b, $e5
    db $3e, $93, $22, $42, $05, $05, $3e, $80, $22, $05, $20, $fc, $3e, $94, $22, $e1
    db $3e, $40, $cd, $8f, $08, $0d, $20, $e7, $3e, $95, $22, $42, $05, $05, $3e, $96
    db $22, $05, $20, $fc, $3e, $97, $22, $e1, $c9, $7d, $ea, $c1, $d7, $7c, $ea, $c2
    db $d7, $cd, $3f, $09, $fa, $c1, $d7, $5f, $fa, $c2, $d7, $57, $1a, $4f, $13, $7b
    db $ea, $c1, $d7, $7a, $ea, $c2, $d7, $79, $fe, $ff, $28, $18, $06, $00, $11, $00
    db $40, $1a, $13, $b9, $28, $08, $04, $78, $fe, $80, $20, $f5, $06, $00, $78, $f6
    db $80, $22, $18, $d0, $fa, $c1, $d7, $6f, $fa, $c2, $d7, $67, $c9, $cd, $3f, $09
    db $d5, $c1, $e5, $78, $26, $64, $fe, $03, $28, $08, $26, $0a, $fe, $02, $28, $02
    db $26, $01, $2e, $00, $79, $bc, $38, $05, $94, $4f, $2c, $18, $f7, $7d, $e1, $3c
    db $ee, $80, $22, $05, $20, $dc, $c9, $3e, $00, $ea, $09, $d9, $ea, $0a, $d9, $cd
    db $2b, $63, $cd, $7b, $63, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2
    db $b5, $61, $cb, $4f, $c2, $d7, $61, $cb, $57, $c2, $ec, $61, $cb, $67, $c2, $4b
    db $62, $cb, $6f, $c2, $84, $62, $cb, $77, $c2, $a9, $62, $cb, $7f, $c2, $e4, $62
    db $cd, $5d, $08, $18, $cd, $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $c6, $20, $ea
    db $9a, $d7, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb
    db $47, $c2, $c7, $61, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd
    db $9c, $07, $f0, $8c, $cb, $4f, $c2, $dc, $61, $3e, $ff, $c9, $3e, $0a, $cd, $07
    db $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $57, $20, $f4, $fa, $09, $d9
    db $47, $fa, $0a, $d9, $80, $c6, $20, $ea, $9a, $d7, $cd, $44, $12, $3e, $00, $ea
    db $9d, $d7, $ea, $9e, $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7, $21, $72, $d5
    db $01, $50, $01, $3e, $ff, $cd, $0f, $08, $cd, $24, $12, $3e, $00, $ea, $a1, $d7
    db $cd, $10, $16, $fe, $00, $ca, $b5, $61, $fe, $01, $c2, $2b, $62, $3e, $0d, $cd
    db $07, $0d, $cd, $e7, $0d, $cd, $2b, $63, $c3, $82, $61, $fa, $0a, $d9, $fe, $21
    db $d2, $82, $61, $c6, $0b, $ea, $0a, $d9, $cd, $2b, $63, $fa, $0a, $d9, $fe, $21
    db $da, $6f, $62, $fa, $09, $d9, $fe, $06, $38, $05, $3e, $06, $ea, $09, $d9, $3e
    db $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $67, $c2, $74
    db $62, $c3, $82, $61, $fa, $0a, $d9, $fe, $00, $ca, $82, $61, $d6, $0b, $ea, $0a
    db $d9, $cd, $2b, $63, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0
    db $8c, $cb, $6f, $c2, $99, $62, $c3, $82, $61, $fa, $09, $d9, $fe, $00, $28, $0b
    db $3d, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe, $00
    db $ca, $82, $61, $d6, $0b, $ea, $0a, $d9, $cd, $2b, $63, $3e, $0a, $ea, $09, $d9
    db $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $77, $20
    db $f4, $c3, $82, $61, $fa, $09, $d9, $fe, $0a, $28, $17, $47, $fa, $0a, $d9, $80
    db $fe, $27, $30, $28, $fa, $09, $d9, $3c, $ea, $09, $d9, $3e, $03, $cd, $07, $0d
    db $18, $1a, $fa, $0a, $d9, $fe, $21, $ca, $82, $61, $c6, $0b, $ea, $0a, $d9, $cd
    db $2b, $63, $3e, $00, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd
    db $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $82, $61, $cd, $33, $09, $06, $01
    db $0e, $01, $16, $12, $1e, $0e, $cd, $3a, $60, $21, $09, $58, $06, $04, $0e, $03
    db $cd, $09, $61, $06, $00, $fa, $0a, $d9, $80, $fe, $28, $30, $2a, $c5, $16, $00
    db $5f, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb
    db $12, $21, $16, $58, $cd, $ba, $08, $78, $c6, $05, $4f, $06, $05, $cd, $09, $61
    db $c1, $04, $78, $fe, $0b, $20, $ce, $cd, $bb, $0a, $c9, $fa, $09, $d9, $cb, $27
    db $cb, $27, $cb, $27, $c6, $38, $5f, $16, $20, $3e, $00, $0e, $7f, $cd, $ff, $08
    db $c9, $3e, $00, $ea, $09, $d9, $ea, $0a, $d9, $cd, $3a, $65, $cd, $8a, $65, $cd
    db $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $cf, $63, $cb, $4f, $c2, $f1
    db $63, $cb, $57, $c2, $06, $64, $cb, $67, $c2, $5a, $64, $cb, $6f, $c2, $93, $64
    db $cb, $77, $c2, $b8, $64, $cb, $7f, $c2, $f3, $64, $cd, $5d, $08, $18, $cd, $fa
    db $09, $d9, $47, $fa, $0a, $d9, $80, $c6, $20, $ea, $9a, $d7, $3e, $0a, $cd, $07
    db $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $e1, $63, $3e, $00
    db $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $4f
    db $c2, $f6, $63, $3e, $ff, $c9, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c
    db $07, $f0, $8c, $cb, $57, $20, $f4, $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $c6
    db $20, $ea, $9a, $d7, $cd, $44, $12, $3e, $00, $ea, $9d, $d7, $ea, $9e, $d7, $3e
    db $05, $ea, $9f, $d7, $ea, $a0, $d7, $cd, $24, $12, $3e, $00, $ea, $a1, $d7, $cd
    db $10, $16, $fe, $00, $ca, $cf, $63, $fe, $01, $c2, $3a, $64, $3e, $0d, $cd, $07
    db $0d, $cd, $e7, $0d, $cd, $3a, $65, $c3, $9c, $63, $fa, $0a, $d9, $fe, $21, $d2
    db $9c, $63, $c6, $0b, $ea, $0a, $d9, $cd, $3a, $65, $fa, $0a, $d9, $fe, $21, $da
    db $7e, $64, $fa, $09, $d9, $fe, $06, $38, $05, $3e, $06, $ea, $09, $d9, $3e, $03
    db $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $67, $c2, $83, $64
    db $c3, $9c, $63, $fa, $0a, $d9, $fe, $00, $ca, $9c, $63, $d6, $0b, $ea, $0a, $d9
    db $cd, $3a, $65, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c
    db $cb, $6f, $c2, $a8, $64, $c3, $9c, $63, $fa, $09, $d9, $fe, $00, $28, $0b, $3d
    db $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe, $00, $ca
    db $9c, $63, $d6, $0b, $ea, $0a, $d9, $cd, $3a, $65, $3e, $0a, $ea, $09, $d9, $3e
    db $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $77, $20, $f4
    db $c3, $9c, $63, $fa, $09, $d9, $fe, $0a, $28, $17, $47, $fa, $0a, $d9, $80, $fe
    db $27, $30, $28, $fa, $09, $d9, $3c, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18
    db $1a, $fa, $0a, $d9, $fe, $21, $ca, $9c, $63, $c6, $0b, $ea, $0a, $d9, $cd, $3a
    db $65, $3e, $00, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c
    db $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $9c, $63, $cd, $33, $09, $06, $01, $0e
    db $01, $16, $12, $1e, $0e, $cd, $3a, $60, $21, $d6, $5a, $06, $04, $0e, $03, $cd
    db $09, $61, $06, $00, $fa, $0a, $d9, $80, $fe, $28, $30, $2a, $c5, $16, $00, $5f
    db $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12
    db $21, $e2, $5a, $cd, $ba, $08, $78, $c6, $05, $4f, $06, $05, $cd, $09, $61, $c1
    db $04, $78, $fe, $0b, $20, $ce, $cd, $bb, $0a, $c9, $fa, $09, $d9, $cb, $27, $cb
    db $27, $cb, $27, $c6, $38, $5f, $16, $20, $3e, $00, $0e, $7f, $cd, $ff, $08, $c9
    db $3e, $00, $ea, $09, $d9, $ea, $0a, $d9, $cd, $e1, $66, $cd, $31, $67, $cd, $5d
    db $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2, $d4, $65, $cb, $4f, $c2, $f6, $65
    db $cb, $57, $c2, $0b, $66, $cb, $77, $c2, $5f, $66, $cb, $7f, $c2, $9a, $66, $cd
    db $5d, $08, $18, $d7, $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $c6, $48, $ea, $9a
    db $d7, $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47
    db $c2, $e6, $65, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c
    db $07, $f0, $8c, $cb, $4f, $c2, $fb, $65, $3e, $ff, $c9, $3e, $0a, $cd, $07, $0d
    db $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $57, $20, $f4, $fa, $09, $d9, $47
    db $fa, $0a, $d9, $80, $c6, $48, $ea, $9a, $d7, $cd, $44, $12, $3e, $00, $ea, $9d
    db $d7, $ea, $9e, $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7, $cd, $24, $12, $3e
    db $00, $ea, $a1, $d7, $cd, $10, $16, $fe, $00, $ca, $d4, $65, $fe, $01, $c2, $3f
    db $66, $3e, $0d, $cd, $07, $0d, $cd, $e7, $0d, $cd, $e1, $66, $c3, $ab, $65, $fa
    db $09, $d9, $fe, $00, $28, $0b, $3d, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18
    db $1a, $fa, $0a, $d9, $fe, $00, $ca, $ab, $65, $d6, $0b, $ea, $0a, $d9, $cd, $e1
    db $66, $3e, $0a, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c
    db $07, $f0, $8c, $cb, $77, $20, $f4, $c3, $ab, $65, $fa, $09, $d9, $fe, $03, $28
    db $17, $47, $fa, $0a, $d9, $80, $fe, $27, $30, $28, $fa, $09, $d9, $3c, $ea, $09
    db $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe, $00, $ca, $ab, $65
    db $c6, $0b, $ea, $0a, $d9, $cd, $e1, $66, $3e, $00, $ea, $09, $d9, $3e, $03, $cd
    db $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $ab
    db $65, $cd, $33, $09, $06, $01, $0e, $01, $16, $12, $1e, $0e, $cd, $3a, $60, $21
    db $62, $5d, $06, $04, $0e, $03, $cd, $09, $61, $06, $00, $fa, $0a, $d9, $80, $fe
    db $04, $30, $2a, $c5, $16, $00, $5f, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb
    db $23, $cb, $12, $cb, $23, $cb, $12, $21, $70, $5d, $cd, $ba, $08, $78, $c6, $05
    db $4f, $06, $05, $cd, $09, $61, $c1, $04, $78, $fe, $0b, $20, $ce, $cd, $bb, $0a
    db $c9, $fa, $09, $d9, $cb, $27, $cb, $27, $cb, $27, $c6, $38, $5f, $16, $20, $3e
    db $00, $0e, $7f, $cd, $ff, $08, $c9, $3e, $00, $ea, $09, $d9, $ea, $0a, $d9, $cd
    db $ec, $68, $cd, $3c, $69, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2
    db $85, $67, $cb, $4f, $c2, $a5, $67, $cb, $57, $c2, $ba, $67, $cb, $67, $c2, $0c
    db $68, $cb, $6f, $c2, $45, $68, $cb, $77, $c2, $6a, $68, $cb, $7f, $c2, $a5, $68
    db $cd, $5d, $08, $18, $cd, $fa, $09, $d9, $47, $fa, $0a, $d9, $80, $ea, $9a, $d7
    db $3e, $0a, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $47, $c2
    db $95, $67, $3e, $00, $c9, $3e, $0d, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07
    db $f0, $8c, $cb, $4f, $c2, $aa, $67, $3e, $ff, $c9, $3e, $0a, $cd, $07, $0d, $cd
    db $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $57, $20, $f4, $fa, $09, $d9, $47, $fa
    db $0a, $d9, $80, $ea, $9a, $d7, $cd, $44, $12, $3e, $00, $ea, $9d, $d7, $ea, $9e
    db $d7, $3e, $05, $ea, $9f, $d7, $ea, $a0, $d7, $cd, $24, $12, $3e, $00, $ea, $a1
    db $d7, $cd, $10, $16, $fe, $00, $ca, $85, $67, $fe, $01, $c2, $ec, $67, $3e, $0d
    db $cd, $07, $0d, $cd, $e7, $0d, $cd, $ec, $68, $c3, $52, $67, $fa, $0a, $d9, $fe
    db $16, $d2, $52, $67, $c6, $0b, $ea, $0a, $d9, $cd, $ec, $68, $fa, $0a, $d9, $fe
    db $16, $da, $30, $68, $fa, $09, $d9, $fe, $09, $38, $05, $3e, $09, $ea, $09, $d9
    db $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $67, $c2
    db $35, $68, $c3, $52, $67, $fa, $0a, $d9, $fe, $00, $ca, $52, $67, $d6, $0b, $ea
    db $0a, $d9, $cd, $ec, $68, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07
    db $f0, $8c, $cb, $6f, $c2, $5a, $68, $c3, $52, $67, $fa, $09, $d9, $fe, $00, $28
    db $0b, $3d, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $18, $1a, $fa, $0a, $d9, $fe
    db $00, $ca, $52, $67, $d6, $0b, $ea, $0a, $d9, $cd, $ec, $68, $3e, $0a, $ea, $09
    db $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08, $cd, $9c, $07, $f0, $8c, $cb, $77
    db $20, $f4, $c3, $52, $67, $fa, $09, $d9, $fe, $0a, $28, $17, $47, $fa, $0a, $d9
    db $80, $fe, $1f, $30, $28, $fa, $09, $d9, $3c, $ea, $09, $d9, $3e, $03, $cd, $07
    db $0d, $18, $1a, $fa, $0a, $d9, $fe, $16, $ca, $52, $67, $c6, $0b, $ea, $0a, $d9
    db $cd, $ec, $68, $3e, $00, $ea, $09, $d9, $3e, $03, $cd, $07, $0d, $cd, $5d, $08
    db $cd, $9c, $07, $f0, $8c, $cb, $7f, $20, $f4, $c3, $52, $67, $cd, $33, $09, $06
    db $01, $0e, $01, $16, $12, $1e, $0e, $cd, $3a, $60, $21, $b0, $5d, $06, $04, $0e
    db $03, $cd, $09, $61, $06, $00, $fa, $0a, $d9, $80, $fe, $20, $30, $2a, $c5, $16
    db $00, $5f, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23, $cb, $12, $cb, $23
    db $cb, $12, $21, $be, $5d, $cd, $ba, $08, $78, $c6, $05, $4f, $06, $05, $cd, $09
    db $61, $c1, $04, $78, $fe, $0b, $20, $ce, $cd, $bb, $0a, $c9, $fa, $09, $d9, $cb
    db $27, $cb, $27, $cb, $27, $c6, $38, $5f, $16, $20, $3e, $00, $0e, $7f, $cd, $ff
    db $08, $c9, $4e, $45, $43, $54, $41, $52, $f5, $3e, $02, $cd, $c8, $05, $ea, $00
    db $40, $fb, $f1, $cb, $27, $57, $1e, $00, $21, $00, $a0, $cd, $ba, $08, $e5, $d1
    db $d5, $d5, $e1, $01, $00, $02, $3e, $00, $cd, $0f, $08, $21, $52, $69, $01, $06
    db $00, $cd, $1a, $08, $fa, $9a, $d7, $12, $13, $fa, $a8, $d7, $12, $13, $21, $a9
    db $d7, $01, $08, $00, $cd, $1a, $08, $fa, $a4, $d7, $12, $13, $fa, $a5, $d7, $12
    db $13, $3e, $00, $12, $13, $12, $13, $06, $08, $21, $18, $d9, $c5, $e5, $2a, $fe
    db $ff, $20, $0a, $3e, $ff, $12, $13, $12, $13, $12, $13, $18, $0f, $47, $12, $13
    db $2a, $4f, $12, $13, $cd, $69, $09, $7e, $e6, $0f, $12, $13, $e1, $c1, $23, $23
    db $05, $20, $d9, $18, $00, $21, $72, $d5, $01, $50, $01, $cd, $1a, $08, $fa, $04
    db $db, $12, $13, $fa, $05, $db, $12, $13, $fa, $06, $db, $12, $13, $fa, $07, $db
    db $12, $13, $21, $c5, $d7, $01, $64, $00, $cd, $1a, $08, $d1, $cd, $27, $6b, $f5
    db $21, $ff, $01, $cd, $ba, $08, $f1, $77, $3e, $00, $cd, $c8, $05, $ea, $00, $40
    db $fb, $c9, $f5, $3e, $02, $cd, $c8, $05, $ea, $00, $40, $fb, $f1, $cb, $27, $57
    db $1e, $00, $21, $00, $a0, $cd, $ba, $08, $e5, $d1, $cd, $27, $6b, $47, $21, $ff
    db $01, $cd, $ba, $08, $7e, $b8, $28, $0c, $3e, $00, $cd, $c8, $05, $ea, $00, $40
    db $fb, $3e, $01, $c9, $21, $52, $69, $06, $06, $7e, $4f, $1a, $b9, $23, $13, $05
    db $20, $f7, $1a, $ea, $9a, $d7, $13, $1a, $ea, $a8, $d7, $13, $21, $a9, $d7, $01
    db $08, $00, $cd, $23, $08, $1a, $ea, $a4, $d7, $13, $1a, $ea, $a5, $d7, $13, $13
    db $13, $06, $08, $c5, $d5, $1a, $fe, $ff, $28, $0c, $47, $13, $1a, $4f, $13, $1a
    db $f5, $cd, $69, $09, $f1, $77, $d1, $13, $13, $13, $c1, $05, $20, $e5, $21, $72
    db $d5, $01, $50, $01, $cd, $23, $08, $1a, $ea, $9f, $d7, $13, $1a, $ea, $a0, $d7
    db $13, $1a, $ea, $9d, $d7, $13, $1a, $ea, $9e, $d7, $13, $21, $c5, $d7, $01, $64
    db $00, $cd, $23, $08, $3e, $00, $cd, $c8, $05, $ea, $00, $40, $fb, $3e, $00, $c9
    db $f5, $3e, $02, $cd, $c8, $05, $ea, $00, $40, $fb, $f1, $cb, $27, $57, $1e, $00
    db $21, $00, $a0, $cd, $ba, $08, $e5, $d1, $cd, $27, $6b, $47, $21, $ff, $01, $cd
    db $ba, $08, $7e, $b8, $28, $18, $3e, $00, $cd, $c8, $05, $ea, $00, $40, $fb, $3e
    db $01, $c9, $3e, $00, $cd, $c8, $05, $ea, $00, $40, $fb, $3e, $ff, $c9, $d5, $21
    db $eb, $d8, $06, $14, $1a, $22, $13, $05, $20, $fa, $d1, $21, $52, $69, $06, $06
    db $7e, $4f, $1a, $b9, $20, $dc, $23, $13, $05, $20, $f5, $3e, $00, $cd, $c8, $05
    db $ea, $00, $40, $fb, $3e, $00, $c9, $d5, $d5, $e1, $01, $fe, $01, $16, $00, $2a
    db $82, $57, $0b, $78, $b1, $20, $f8, $7a, $d1, $c9, $f5, $3e, $02, $cd, $c8, $05
    db $ea, $00, $40, $fb, $f1, $cb, $27, $57, $1e, $00, $e5, $21, $00, $a0, $cd, $ba
    db $08, $5d, $54, $e1, $01, $00, $02, $1a, $22, $13, $0b, $78, $b1, $20, $f8, $3e
    db $00, $cd, $c8, $05, $ea, $00, $40, $fb, $c9, $f5, $3e, $02, $cd, $c8, $05, $ea
    db $00, $40, $fb, $f1, $cb, $27, $57, $1e, $00, $e5, $21, $00, $a0, $cd, $ba, $08
    db $5d, $54, $e1, $01, $00, $02, $2a, $12, $13, $0b, $78, $b1, $20, $f8, $3e, $00
    db $cd, $c8, $05, $ea, $00, $40, $fb, $c9, $3e, $0d, $cd, $58, $69, $3e, $02, $cd
    db $c8, $05, $ea, $00, $40, $fb, $21, $00, $a0, $3e, $88, $77, $3e, $00, $cd, $c8
    db $05, $ea, $00, $40, $fb, $c9, $3e, $02, $cd, $c8, $05, $ea, $00, $40, $fb, $21
    db $00, $a0, $3e, $00, $77, $3e, $00, $cd, $c8, $05, $ea, $00, $40, $fb, $c9, $3e
    db $02, $cd, $c8, $05, $ea, $00, $40, $fb, $21, $00, $a0, $7e, $f5, $3e, $00, $cd
    db $c8, $05, $ea, $00, $40, $fb, $f1, $c9, $3e, $02, $cd, $c8, $05, $ea, $00, $40
    db $fb, $21, $00, $be, $06, $00, $2a, $fe, $41, $20, $07, $7e, $fe, $54, $20, $02
    db $06, $01, $78, $f5, $3e, $00, $cd, $c8, $05, $ea, $00, $40, $fb, $f1, $c9, $f5
    db $3e, $02, $cd, $c8, $05, $ea, $00, $40, $fb, $f1, $06, $41, $fe, $00, $28, $02
    db $06, $54, $21, $00, $be, $cd, $8f, $08, $78, $77, $f5, $3e, $00, $cd, $c8, $05
    db $ea, $00, $40, $fb, $f1, $c9, $00
